Infineon/psoc4pdl/drivers/source/cy_sysclk.c
/***************************************************************************//**
* \file cy_sysclk.c
* \version 1.0
*
* Provides an API implementation of the sysclk driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#include "cy_sysclk.h"
#include "cy_syslib.h"
#include <stdlib.h>


/* ========================================================================== */
/* =========================    EXTCLK SECTION    =========================== */
/* ========================================================================== */

/** \cond INTERNAL */
static uint32_t extFreq = 0UL; /* Internal storage for external clock frequency user setting */

#define CY_SYSCLK_EXTCLK_MAX_FREQ (100000000UL) /* 100 MHz */
/** \endcond */

/**
* \addtogroup group_sysclk_ext_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_ExtClkSetFrequency
****************************************************************************//**
*
* Sets the signal frequency of the External Clock Source (EXTCLK) into the
* internal storage to be used in \ref Cy_SysClk_ClkHfGetFrequency.
*
* \param freq The frequency of the External Clock Source.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ExtClkSetFrequency
*
*******************************************************************************/
void Cy_SysClk_ExtClkSetFrequency(uint32_t freq)
{
    if (freq <= CY_SYSCLK_EXTCLK_MAX_FREQ)
    {
        extFreq = freq;
    }
}


/*******************************************************************************
* Function Name: Cy_SysClk_ExtClkGetFrequency
****************************************************************************//**
*
* Returns the frequency of the External Clock Source (EXTCLK) from the
* internal storage.
*
* \return The frequency of the External Clock Source.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ExtClkSetFrequency
*
*******************************************************************************/
uint32_t Cy_SysClk_ExtClkGetFrequency(void)
{
    return (extFreq);
}
/** \} group_sysclk_ext_funcs */


/* ========================================================================== */
/* ===========================    IMO SECTION    ============================ */
/* ========================================================================== */



#define CY_SYSCLK_IS_FREQ_VALID(freq)  (((uint32_t)CY_SYSCLK_IMO_24MHZ == (freq)) || \
                                        ((uint32_t)CY_SYSCLK_IMO_28MHZ == (freq)) || \
                                        ((uint32_t)CY_SYSCLK_IMO_32MHZ == (freq)) || \
                                        ((uint32_t)CY_SYSCLK_IMO_36MHZ == (freq)) || \
                                        ((uint32_t)CY_SYSCLK_IMO_40MHZ == (freq)) || \
                                        ((uint32_t)CY_SYSCLK_IMO_44MHZ == (freq)) || \
                                        ((uint32_t)CY_SYSCLK_IMO_48MHZ == (freq)))

#define CY_SYSCLK_FREQ_SCALER           (1000000UL)


/*******************************************************************************
* Function Name: Cy_SysClk_ImoSetFrequency
****************************************************************************//**
*
* Sets the IMO desired frequency.
*
* \note There is a \ref Cy_SysClk_ImoLock feature to improve an IMO precision.
*
* \param freq - the desired IMO frequency, \ref cy_en_sysclk_imo_freq_t.
*
* \note Call \ref SystemCoreClockUpdate after this function calling
* if it affects the ClkSys frequency.
*
* \note Call \ref Cy_SysLib_SetWaitStates before calling this function if
* ClkSys frequency is increasing.
*
* \note Call \ref Cy_SysLib_SetWaitStates after calling this function if
* ClkSys frequency is decreasing.
*
* \return Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - the frequency is set as requested \n
* CY_SYSCLK_BAD_PARAM - Invalid parameter.
* CY_SYSCLK_INVALID_STATE - IMO is not enabled.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ImoSetFrequency(cy_en_sysclk_imo_freq_t freq)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    if (Cy_SysClk_ImoIsEnabled())
    {
        if (CY_SYSCLK_IS_FREQ_VALID(freq))
        {
            if ((uint32_t) freq != Cy_SysClk_ImoGetFrequency())
            {
                /* Convert the frequency value in Hz into the SFLASH.IMO_TRIM register index */
                uint32_t locFreq = ((uint32_t)freq - (uint32_t)CY_SYSCLK_IMO_24MHZ) / CY_SYSCLK_FREQ_SCALER;
                uint32_t intStat = Cy_SysLib_EnterCriticalSection();
                cy_en_sysclk_imo_lock_t lock = Cy_SysClk_ImoGetLockStatus();

                /* Unlock if locked */
                if (CY_SYSCLK_IMO_LOCK_NONE != lock)
                {
                    (void) Cy_SysClk_ImoLock(CY_SYSCLK_IMO_LOCK_NONE);
                }

                /* Set IMO to 24 MHz */
                SRSSLT_CLK_IMO_SELECT = 0UL;

                /* Apply coarse trim */
                SRSSLT_CLK_IMO_TRIM1 = SFLASH_IMO_TRIM_LT(locFreq);

                /* Zero out fine trim */
                SRSSLT_CLK_IMO_TRIM2 = 0UL;

                /* Apply TC trim */
                SRSSLT_CLK_IMO_TRIM3 = SFLASH_IMO_TCTRIM_LT(locFreq);

                /* Convert the SFLASH.IMO_TRIM register index into the frequency bitfield value */
                locFreq >>= 2UL;

                Cy_SysLib_DelayCycles(50UL);

