Infineon/psoc4pdl/drivers/source/cy_sysclk.c
                if (0UL != locFreq)
                {
                    /* Select nearby intermediate frequency */
                    CY_REG32_CLR_SET(SRSSLT_CLK_IMO_SELECT, SRSSLT_CLK_IMO_SELECT_FREQ, locFreq - 1UL);

                    Cy_SysLib_DelayCycles(50UL);

                    /* Make small step to final frequency */
                    CY_REG32_CLR_SET(SRSSLT_CLK_IMO_SELECT, SRSSLT_CLK_IMO_SELECT_FREQ, locFreq);
                }

                /* Restore locking */
                if (CY_SYSCLK_IMO_LOCK_NONE != lock)
                {
                    (void) Cy_SysClk_ImoLock(lock);
                }

                Cy_SysLib_ExitCriticalSection(intStat);
            }

            retVal = CY_SYSCLK_SUCCESS;
        }
    }
    else
    {
        retVal = CY_SYSCLK_INVALID_STATE;
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_ImoGetFrequency
****************************************************************************//**
*
* Returns the IMO nominal frequency.
*
* \return the frequency value in Hz.
*
*******************************************************************************/
uint32_t Cy_SysClk_ImoGetFrequency(void)
{
    return (Cy_SysClk_ImoIsEnabled() ?
            (((_FLD2VAL(SRSSLT_CLK_IMO_SELECT_FREQ, SRSSLT_CLK_IMO_SELECT) << 2UL) *
              CY_SYSCLK_FREQ_SCALER) + (uint32_t)CY_SYSCLK_IMO_24MHZ) : 0UL);
}


/*******************************************************************************
* Function Name: Cy_SysClk_ImoGetLockStatus
****************************************************************************//**
*
* Returns IMO lock status.
*
* \return IMO lock state \ref cy_en_sysclk_imo_lock_t.
*
*******************************************************************************/
cy_en_sysclk_imo_lock_t Cy_SysClk_ImoGetLockStatus(void)
{
    cy_en_sysclk_imo_lock_t retVal = CY_SYSCLK_IMO_LOCK_NONE;

    if (_FLD2BOOL(WCO_CONFIG_DPLL_ENABLE, WCO_CONFIG))
    {
        retVal = CY_SYSCLK_IMO_LOCK_WCO;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_ImoLock
****************************************************************************//**
*
* Locks/unlocks IMO.
*
* \param lock - the desired IMO lock state, \ref cy_en_sysclk_imo_lock_t
*
* \return Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - the lock state is set as requested \n
* CY_SYSCLK_BAD_PARAM - Invalid parameter \n
* CY_SYSCLK_INVALID_STATE - Invalid state (IMO or WCO is not enabled, etc.)
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ImoLock(cy_en_sysclk_imo_lock_t lock)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    if ((CY_SYSCLK_IMO_LOCK_NONE == lock) ||
        (CY_SYSCLK_IMO_LOCK_WCO  == lock))
    {
        if (!Cy_SysClk_ImoIsEnabled())
        {
            retVal = CY_SYSCLK_INVALID_STATE;
        }
        else if (lock == Cy_SysClk_ImoGetLockStatus())
        {
            /* Do nothing, the lock is already as requested */
            retVal = CY_SYSCLK_SUCCESS;
        }
        else if ((CY_SYSCLK_IMO_LOCK_NONE == lock))
        {
            WCO_CONFIG &= ~WCO_CONFIG_DPLL_ENABLE_Msk;

            /* Convert the IMO_SELECT_FREQ value into the SFLASH.IMO_TRIM register index */
            SRSSLT_CLK_IMO_TRIM1 = SFLASH_IMO_TRIM_LT((_FLD2VAL(SRSSLT_CLK_IMO_SELECT_FREQ, SRSSLT_CLK_IMO_SELECT) << 2UL));

            retVal = CY_SYSCLK_SUCCESS;
        }
        else if ((CY_SYSCLK_IMO_LOCK_WCO == lock))
        {
            if(!Cy_SysClk_WcoIsEnabled())
            {
                retVal = CY_SYSCLK_INVALID_STATE;
            }
            else
            {
                uint32_t regTmp = 0uL;
                uint32_t lfLimit = 0uL;
                uint32_t flashCtlReg = 0uL;

                /* Set oscillator interface control port to WCO */
                SRSSLT_CLK_IMO_TRIM1 = 0UL;

                /* For the WCO locking mode, the IMO gain needs to be CY_SYS_CLK_IMO_TRIM4_GAIN */
                regTmp = (_CLR_SET_FLD32U(WCO_DPLL, WCO_DPLL_DPLL_MULT,     0) |
                          _CLR_SET_FLD32U(WCO_DPLL, WCO_DPLL_DPLL_LF_IGAIN, 0) |
                          _CLR_SET_FLD32U(WCO_DPLL, WCO_DPLL_DPLL_LF_PGAIN, 0) |
                          _CLR_SET_FLD32U(WCO_DPLL, WCO_DPLL_DPLL_LF_LIMIT, 0));

                /* Set multiplier to determine IMO frequency in multiples of the WCO frequency */
                regTmp |= CY_SYSLIB_DIV_ROUND(Cy_SysClk_ImoGetFrequency(), CY_SYSCLK_WCO_FREQ) & WCO_DPLL_DPLL_MULT_Msk;

                /* Set DPLL Loop Filter Integral and Proportional Gains Setting */
                regTmp |= (_FLD2VAL(WCO_DPLL_DPLL_LF_IGAIN, WCO_DPLL) | _FLD2VAL(WCO_DPLL_DPLL_LF_PGAIN, WCO_DPLL));

                WCO_DPLL = regTmp;

                flashCtlReg = CPUSS_FLASH_CTL;
                Cy_SysLib_SetWaitStates(48);

                WCO_CONFIG |= _VAL2FLD(WCO_CONFIG_IP_ENABLE, 0x1u);

                regTmp  = (WCO_DPLL & ~WCO_DPLL_DPLL_LF_LIMIT_Msk);

                while (lfLimit < (CY_SYSCLK_WCO_CONFIG_DPLL_LF_LIMIT_MAX - CY_SYSCLK_WCO_CONFIG_DPLL_LF_LIMIT_STEP))
                {
                    Cy_SysLib_Delay(CY_SYSCLK_WCO_DPLL_TIMEOUT_MS);
                    lfLimit += CY_SYSCLK_WCO_CONFIG_DPLL_LF_LIMIT_STEP;
                    WCO_DPLL = (regTmp | (lfLimit << WCO_DPLL_DPLL_LF_LIMIT_Pos));
                }

                Cy_SysLib_Delay(CY_SYSCLK_WCO_DPLL_TIMEOUT_MS);
                WCO_DPLL = (regTmp | (CY_SYSCLK_WCO_CONFIG_DPLL_LF_LIMIT_MAX << WCO_DPLL_DPLL_LF_LIMIT_Pos));

                CPUSS_FLASH_CTL = flashCtlReg;

                retVal = CY_SYSCLK_SUCCESS;
            }
        }
        else
        {
            /* Do nothing, all the cases are addressed */
        }
    }

    return(retVal);
}



/* ========================================================================== */
/* ===========================    ILO SECTION    ============================ */
/* ========================================================================== */

