Infineon/psoc4pdl/drivers/source/cy_sysclk.c
/** \cond */
#define SRSSLT_CLK_DFT_SELECT_DFT_SEL_NC  (0UL) /* DFT_SEL not connected (output is 0) */
#define SRSSLT_CLK_DFT_SELECT_DFT_SEL_ILO (1UL) /* DFT_SEL ILO output */

#define SRSSLT_CLK_DFT_SELECT_DFT_CHCK_MSK (SRSSLT_CLK_DFT_SELECT_DFT_SEL0_Msk | \
                                            SRSSLT_CLK_DFT_SELECT_DFT_SEL1_Msk)
#define SRSSLT_CLK_DFT_SELECT_DFT_CHCK_VAL (_VAL2FLD(SRSSLT_CLK_DFT_SELECT_DFT_SEL0, \
                                                     SRSSLT_CLK_DFT_SELECT_DFT_SEL_NC) | \
                                            _VAL2FLD(SRSSLT_CLK_DFT_SELECT_DFT_SEL1, \
                                                     SRSSLT_CLK_DFT_SELECT_DFT_SEL_ILO))

#define SRSSLT_TST_DDFT_CTRL_DFT_SEL0_Pos   0UL
#define SRSSLT_TST_DDFT_CTRL_DFT_SEL0_Msk   0xFUL
#define SRSSLT_TST_DDFT_CTRL_DFT_SEL1_Pos   8UL
#define SRSSLT_TST_DDFT_CTRL_DFT_SEL1_Msk   0xF00UL

#define SRSSLT_TST_DDFT_CTRL_DFT_SEL_CLK0   (8UL)
#define SRSSLT_TST_DDFT_CTRL_DFT_SEL_CLK1   (9UL)

#define SRSSLT_TST_DDFT_CTRL_DFT_SEL_Pos    (SRSSLT_TST_DDFT_CTRL_DFT_SEL0_Pos)
#define SRSSLT_TST_DDFT_CTRL_DFT_SEL_Msk    (SRSSLT_TST_DDFT_CTRL_DFT_SEL0_Msk | SRSSLT_TST_DDFT_CTRL_DFT_SEL1_Msk)

/** \endcond */


/******************************************************************************
* Function Name: Cy_SysClk_IloStartMeasurement
***************************************************************************//**
*
* \brief Starts the ILO accuracy measurement.
*
* This function is non-blocking and needs to be called before using the
* CySysClkIloTrim() and CySysClkIloCompensate() functions.
*
* This function configures measurement counters to be sourced by SysClk (Counter 1)
* and ILO (Counter 2).
*
* \note SysClk should be sourced by IMO. Otherwise
* CySysClkIloCompensate() function can give incorrect results.
*
******************************************************************************/
void Cy_SysClk_IloStartMeasurement(void)
{
    /* Configure measurement counters to source by SysClk (Counter 1) and ILO (Counter 2)*/
    CY_REG32_CLR_SET(SRSSLT_CLK_DFT_SELECT,
                     SRSSLT_CLK_DFT_SELECT_DFT_SEL1,
                     SRSSLT_CLK_DFT_SELECT_DFT_SEL_ILO);

    CY_REG32_CLR_SET(SRSSLT_TST_DDFT_CTRL,
                     SRSSLT_TST_DDFT_CTRL_DFT_SEL,
           (_VAL2FLD(SRSSLT_TST_DDFT_CTRL_DFT_SEL0,
                     SRSSLT_TST_DDFT_CTRL_DFT_SEL_CLK0) |
            _VAL2FLD(SRSSLT_TST_DDFT_CTRL_DFT_SEL1,
                     SRSSLT_TST_DDFT_CTRL_DFT_SEL_CLK1)));
}


/******************************************************************************
* Function Name: CySysClkIloStopMeasurement
***************************************************************************//**
* \brief
* Stops the ILO accuracy measurement.
*
* Calling this function immediately stops the the ILO frequency measurement.
* This function should be called before placing the device to deepsleep, if
* \ref Cy_SysClk_IloStartMeasurement() API was called before.
*
******************************************************************************/
void Cy_SysClk_IloStopMeasurement(void)
{
    /* Set default configurations in 11...8 DFT register bits to zero */
    SRSSLT_CLK_DFT_SELECT &= ~SRSSLT_CLK_DFT_SELECT_DFT_SEL1_Msk;
    SRSSLT_TST_DDFT_CTRL &= SRSSLT_TST_DDFT_CTRL_DFT_SEL_Msk;
}


#define MAX_DELAY_US                     (0x1E8480UL) /* 2s */
#define MIN_DELAY_US                     (0x64UL)     /* 100 us */
#define COEF_PHUNDRED                    (0x64UL)
#define ILO_PERIOD_PPH                   (0x09C4UL)
#define HALF_OF_CLOCK                    (ILO_PERIOD_PPH >> 2U)
#define SYS_CLK_DIVIDER                  (0x0AUL)
#define ILO_FREQ_2MSB                    (0x28UL)
#define ILO_FREQ_3LSB                    (0x3E8UL)
#define ILO_DESIRED_FREQ_HZ              (40000UL)

/**********************************************************************************
* Cy_SysClk_IloCompensate() - value to walk over oversamling in calculations with
* srsslite. The oversample can be obtained when ilo frequency in equal 80 KHz and
* desired clocks are 80 000 clocks.
**********************************************************************************/
#define MAX_LITE_NUMBER                  (53600UL)

/******************************************************************************
* Function Name: CySysClkIloCompensate
***************************************************************************//**
*
* \brief Measures the current ILO accuracy.
*
* Basing on the measured frequency the required number of ILO cycles for a
* given delay (in microseconds) is obtained. The desired delay that needs to
* be compensated is passed through the desiredDelay parameter. The compensated
* cycle count is returned through the compesatedCycles pointer.
* The compensated ILO cycles can then be used to define the WDT period value,
* effectively compensating for the ILO inaccuracy and allowing a more
* accurate WDT interrupt generation.
*
* \ref Cy_SysClk_IloStartMeasurement() function should be called prior to calling this function.
*
* \note SysClk should be sourced by IMO. Otherwise
* Cy_SysClk_IloCompensate() function can give incorrect results.
*
* \note If the System clock frequency is changed in runtime, the
* \ref SystemCoreClockUpdate() should be called before
* calling a next Cy_SysClk_IloCompensate().
*
* \note For a correct WDT or DeepSleep Timers functioning with ILO compensating
* the \ref Cy_SysClk_IloCompensate() should be called before WDT or DeepSleep Timers
* enabling.
*
* \warning Do not enter deep sleep mode until the function returns CY_SYSCLK_SUCCESS.
*
* \param desiredDelay Required delay in microseconds.
*                     Valid range is 100 ... 2 000 000 us.
*
* \param *compensatedCycles The pointer to the variable in which the required
* number of ILO cycles for the given delay will be returned.
*
* \details The value returned in *compensatedCycles pointer is not valid until the
* function returns CY_SYSCLK_SUCCESS.
*
* \return The status \ref cy_en_sysclk_status_t
* - \ref CY_SYSCLK_SUCCESS - The compensation process is complete and the
* compensated cycles value is returned in the compensatedCycles pointer.
* - CY_SYSCLK_BAD_PARAM - One or more invalid parameters
* - \ref CY_SYSCLK_STARTED - Indicates measurement is in progress. It is
* strongly recommended to do not make pauses between API calling. The
* function should be called repeatedly until the API returns CY_SYSCLK_SUCCESS.
* - \ref CY_SYSCLK_INVALID_STATE - Indicates that measurement not started.
* The user should call \ref Cy_SysClk_IloStartMeasurement() API before calling
* this function.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_IloCompensate(uint32_t desiredDelay , uint32_t * compensatedCycles)
{
    uint32_t iloCompensatedCycles;
    uint32_t desiredDelayInCounts;
    static bool compRunStat = false; /* compensation running status */
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;

