Infineon/psoc4pdl/drivers/source/cy_sysclk.c
    if ((MIN_DELAY_US > desiredDelay) ||
        (MAX_DELAY_US < desiredDelay) ||
        (NULL == compensatedCycles))
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }
    /* Check if CySysStartMeasurement was called before */
    else if ((SRSSLT_CLK_DFT_SELECT_DFT_CHCK_VAL == (SRSSLT_CLK_DFT_SELECT & SRSSLT_CLK_DFT_SELECT_DFT_CHCK_MSK)) &&
        (SRSSLT_TST_DDFT_CTRL == (_VAL2FLD(SRSSLT_TST_DDFT_CTRL_DFT_SEL0,
                                           SRSSLT_TST_DDFT_CTRL_DFT_SEL_CLK0) |
                                  _VAL2FLD(SRSSLT_TST_DDFT_CTRL_DFT_SEL1,
                                           SRSSLT_TST_DDFT_CTRL_DFT_SEL_CLK1))))
    {
        if(compRunStat)
        {
            /* Wait until counter 1 stopped counting and after it calculate compensated cycles */
            if(0UL != (SRSSLT_TST_TRIM_CNTR1 & SRSSLT_TST_TRIM_CNTR1_COUNTER_DONE_Msk))
            {
                if (0UL != SRSSLT_TST_TRIM_CNTR2)
                {
                    /* Calculate required number of ILO cycles for given delay */
                    desiredDelayInCounts = ((desiredDelay * COEF_PHUNDRED) + HALF_OF_CLOCK) /
                                                                             ILO_PERIOD_PPH;
                    if(MAX_LITE_NUMBER < desiredDelayInCounts)
                    {
                        iloCompensatedCycles = (((SRSSLT_TST_TRIM_CNTR2 * SystemCoreClock) /
                            (SystemCoreClock >> SYS_CLK_DIVIDER)) / ILO_FREQ_2MSB) * (desiredDelayInCounts / ILO_FREQ_3LSB);
                    }
                    else
                    {
                        iloCompensatedCycles = (((SRSSLT_TST_TRIM_CNTR2 * SystemCoreClock) /
                            (SystemCoreClock >> SYS_CLK_DIVIDER)) * desiredDelayInCounts) / ILO_DESIRED_FREQ_HZ;
                    }

                    *compensatedCycles = iloCompensatedCycles;
                    compRunStat = false;
                    retVal = CY_SYSCLK_SUCCESS;
                }
            }
            else
            {
                retVal = CY_SYSCLK_STARTED;
            }
        }
        else
        {
            /* Reload CNTR 1 count value for next measurement cycle*/
            SRSSLT_TST_TRIM_CNTR1 = (SystemCoreClock >> SYS_CLK_DIVIDER);
            compRunStat = true;
            retVal = CY_SYSCLK_STARTED;
        }
    }
    else
    {
        /* Do nothing, return CY_SYSCLK_INVALID_STATE */
    }

    return (retVal);
}


#if defined (CY_IP_M0S8EXCO) || defined(CY_DOXYGEN)
/* ========================================================================== */
/* ===========================    ECO SECTION    ============================ */
/* ========================================================================== */

#define CY_SYSCLK_ECO_CONFIG_CLK_EN_TIMEOUT_US (10U)


/** \cond *********************************************************************
* Function Name: cy_sqrt
* Calculates square root.
* input is 32-bit wide.
* result is 16-bit wide.
*******************************************************************************/
static uint32_t cy_sqrt(uint32_t x);
static uint32_t cy_sqrt(uint32_t x)
{
    uint32_t i;
    uint32_t res = 0UL;
    uint32_t add = 0x8000UL;

    for(i = 0UL; i < 16UL; i++)
    {
        uint32_t tmp = res | add;

        if (x >= (tmp * tmp))
        {
            res = tmp;
        }

        add >>= 1U;
    }

    return (res);
}

static uint32_t ecoFreq = 0UL; /* Internal storage for ECO frequency user setting */

#define CY_SYSCLK_ECO_FREQ_MIN (4000000UL)  /* 4 MHz */
#define CY_SYSCLK_ECO_FREQ_MAX (33000000UL) /* 33 MHz */
#define CY_SYSCLK_ECO_CLD_MAX  (100UL)      /* 100 pF */
#define CY_SYSCLK_ECO_ESR_MAX  (1000UL)     /* 1000 Ohm */
#define CY_SYSCLK_ECO_DRV_MAX  (2000UL)     /* 2 mW */

#define CY_SYSCLK_ECO_IS_FREQ_VALID(freq) ((CY_SYSCLK_ECO_FREQ_MIN <= (freq)) && ((freq) <= CY_SYSCLK_ECO_FREQ_MAX))
#define CY_SYSCLK_ECO_IS_CLD_VALID(cld)   ((0UL < (cld)) && ((cld) <= CY_SYSCLK_ECO_CLD_MAX))
#define CY_SYSCLK_ECO_IS_ESR_VALID(esr)   ((0UL < (esr)) && ((esr) <= CY_SYSCLK_ECO_ESR_MAX))
#define CY_SYSCLK_ECO_IS_DRV_VALID(drv)   ((0UL < (drv)) && ((drv) <= CY_SYSCLK_ECO_DRV_MAX))
/** \endcond */


/**
* \addtogroup group_sysclk_eco_funcs
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysClk_EcoConfigure
****************************************************************************//**
*
* Configures the external crystal oscillator (ECO) trim bits based on crystal
* characteristics. This function should be called only when the ECO is disabled.
*
* \param freq Operating frequency of the crystal in Hz.
* Valid range: 4000000...35000000 (4..35 MHz).
*
* \param cLoad Crystal load capacitance in pF.
* Valid range: 1...100.
*
* \param esr Effective series resistance of the crystal in ohms.
* Valid range: 1...1000.
*
* \param driveLevel Crystal drive level in uW.
* Valid range: 1...2000.
*
* \return Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - ECO configuration completed successfully \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters \n
* CY_SYSCLK_INVALID_STATE - ECO already enabled
*
* \note
* The following calculations are implemented in integer 32-bitwise math:
*
* \verbatim
*   freqKhz = freq / 1000
*   maxAmpl = sqrt(drivelevel / 2 / esr) / 3.14 / freqKhz / cLoad
*   ampSect = INT(5 * 4 * 3.14^2 * freqKhz^2 * cLoad^2 * 4 * esr / 1000000000 / 1000000 / 4.5)
*
*   As a result of the above calculations, maxAmpl must be >= 0.5, and the
*   number of amplifier sections must be <= 3, otherwise this function returns with
*   a parameter error.
*
*   atrim = maxAmpl < 0.6 ? 0 :
*           maxAmpl < 0.7 ? 1 :
*           maxAmpl < 0.8 ? 2 :
*           maxAmpl < 0.9 ? 3 :
*           maxAmpl < 1.025 ? 4 :
*           maxAmpl < 1.150 ? 5 :
*           maxAmpl < 1.275 ? 6 : 7

*   wdtrim = maxAmpl < 1.2 ? INT(5 * maxAmpl) - 2 : 3

*   gtrim = ampSect > 1 ? ampSect : ampSect == 1 ? 0 : 1

*   rtrim = freqKhz > 30000 ? 0 :
*           freqMHz > 24000 ? 1 :
*           freqMHz > 17000 ? 2 : 3
*
*   ftrim = rtrim
*
* \endverbatim
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoConfigure
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_EcoConfigure(uint32_t freq, uint32_t cLoad, uint32_t esr, uint32_t driveLevel)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

