Infineon/psoc4pdl/drivers/source/cy_sysclk.c
    if (Cy_SysClk_EcoIsEnabled())
    {
        retVal = CY_SYSCLK_INVALID_STATE;
    }
    else if ((CY_SYSCLK_ECO_IS_FREQ_VALID(freq)) &&
             (CY_SYSCLK_ECO_IS_CLD_VALID(cLoad)) &&
             (CY_SYSCLK_ECO_IS_ESR_VALID(esr))   &&
             (CY_SYSCLK_ECO_IS_DRV_VALID(driveLevel)))
    {
        uint32_t freqKhz = CY_SYSLIB_DIV_ROUND(freq, 1000UL);

        /* calculate intermediate values */
        uint32_t maxAmpl = CY_SYSLIB_DIV_ROUND((159155UL * /* 5 * 100000 / PI */
                   cy_sqrt(CY_SYSLIB_DIV_ROUND(2000000UL * driveLevel, esr))), /* scaled by 2 */
                                               (freqKhz * cLoad)); /* The result is scaled by 10^3 */

        /* (4.5 * 10^9) / (5 * 4 * 4 * PI^2) = 5699316,5798814996437182198055472.. -> 56993, scaled by 100 */
        uint32_t ampSect = (CY_SYSLIB_DIV_ROUND(cLoad * cLoad *
                            CY_SYSLIB_DIV_ROUND(freqKhz * freqKhz, 56993UL), 1000UL) * esr) / 1000000UL;

        if ((maxAmpl >= 500UL) && (ampSect <= 3UL)) /* Error if input parameters cause erroneous intermediate values */
        {
            uint32_t wdtrim = (maxAmpl < 1200UL) ? (5 * maxAmpl / 1000UL) - 2UL : 3UL;

            uint32_t atrim = (maxAmpl < 600UL)  ? 0UL :
                            ((maxAmpl < 700UL)  ? 1UL :
                            ((maxAmpl < 800UL)  ? 2UL :
                            ((maxAmpl < 900UL)  ? 3UL :
                            ((maxAmpl < 1025UL) ? 4UL :
                            ((maxAmpl < 1150UL) ? 5UL :
                            ((maxAmpl < 1275UL) ? 6UL : 7UL))))));

            uint32_t ftrim = ((freq > 30000000UL) ? 0UL :
                              ((freq > 24000000UL) ? 1UL :
                               ((freq > 17000000UL) ? 2UL : 3UL)));

            uint32_t gtrim = (ampSect > 1UL) ? ampSect :
                            ((ampSect == 1UL) ? 0UL : 1UL);

            EXCO_ECO_CONFIG = (maxAmpl < 2000UL) ? EXCO_ECO_CONFIG_AGC_EN_Msk : 0x0UL;

            EXCO_ECO_TRIM0 = _VAL2FLD(EXCO_ECO_TRIM0_WDTRIM, wdtrim) |
                             _VAL2FLD(EXCO_ECO_TRIM0_ATRIM, atrim);

            EXCO_ECO_TRIM1 = _VAL2FLD(EXCO_ECO_TRIM1_FTRIM, ftrim) |
                             _VAL2FLD(EXCO_ECO_TRIM1_RTRIM, ftrim) | /* rtrim = ftrim */
                             _VAL2FLD(EXCO_ECO_TRIM1_GTRIM, gtrim);

            ecoFreq = freq; /* Store the ECO frequency */

            retVal = CY_SYSCLK_SUCCESS;
        }
    }
    else
    {
        /* return CY_SYSCLK_BAD_PARAM */
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_EcoEnable
****************************************************************************//**
*
* Enables the external crystal oscillator (ECO). This function should be called
* after \ref Cy_SysClk_EcoConfigure.
*
* \param timeoutUs Amount of time in microseconds to wait for the ECO to stabilize.
* To avoid waiting for stabilization, set this parameter to 0.
*
* \return Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - ECO is enabled \n
* CY_SYSCLK_TIMEOUT - ECO timed out and did not stabilized \n
* CY_SYSCLK_INVALID_STATE - ECO is not configured using \ref Cy_SysClk_EcoConfigure.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoConfigure
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_EcoEnable(uint32_t timeoutUs)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;

    /* Invalid state error if ECO is not configured */
    if (0UL != ecoFreq)
    {
        bool zeroTimeout = (0UL == timeoutUs);

        if (!Cy_SysClk_EcoIsEnabled())
        {
            EXCO_ECO_CONFIG |= EXCO_ECO_CONFIG_ENABLE_Msk;
            Cy_SysLib_DelayUs(CY_SYSCLK_ECO_CONFIG_CLK_EN_TIMEOUT_US);
            EXCO_ECO_CONFIG |= EXCO_ECO_CONFIG_CLK_EN_Msk;
        }

        /* Wait for CY_SYSCLK_ECOSTAT_STABLE */
        while ((CY_SYSCLK_ECO_STABLE != Cy_SysClk_EcoGetStatus()) && (0UL != timeoutUs))
        {
            timeoutUs--;
            Cy_SysLib_DelayUs(1U);
        }

        if (zeroTimeout || (0UL != timeoutUs))
        {
            retVal = CY_SYSCLK_SUCCESS;
        }
        else
        {
            retVal = CY_SYSCLK_TIMEOUT;
            Cy_SysClk_EcoDisable();
        }
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_EcoGetFrequency
****************************************************************************//**
*
* Returns the frequency of the external crystal oscillator (ECO).
*
* \return The frequency of the ECO.
*
* \note If the ECO is not enabled or stable - a zero is returned.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoConfigure
*
*******************************************************************************/
uint32_t Cy_SysClk_EcoGetFrequency(void)
{
    return ((Cy_SysClk_EcoIsEnabled() && (CY_SYSCLK_ECO_STABLE == Cy_SysClk_EcoGetStatus())) ? ecoFreq : 0UL);
}
/** \} group_sysclk_eco_funcs */


#if defined(EXCO_PLL_PRESENT) || defined(CY_DOXYGEN)
/* ========================================================================== */
/* ===========================    PLL SECTION    ============================ */
/* ========================================================================== */

#if defined (EXCO_PLL_REF_IN_EN) || defined(CY_DOXYGEN)

#define  CY_SYSCLK_PLL_IS_SRC_VALID(src) (((src) == CY_SYSCLK_PLL_SRC_ECO) || \
                                          ((src) == CY_SYSCLK_PLL_SRC_IMO))

#define CY_SYSCLK_EXCO_PGM_CLK_SEQ_GEN (5UL)


/*******************************************************************************
* Function Name: EcoSeqGen
********************************************************************************
*
* Generates the ECO clock sequence for EXCO.CLK_SELECT programming.
*
*******************************************************************************/
static void EcoSeqGen(void)
{
    /* Generate clock sequence to change clock source in CY_SYS_ECO_CLK_SELECT_REG */
    EXCO_EXCO_PGM_CLK |= EXCO_EXCO_PGM_CLK_ENABLE_Msk;

    for(uint32_t i = 0UL; i < CY_SYSCLK_EXCO_PGM_CLK_SEQ_GEN; i++)
    {
        EXCO_EXCO_PGM_CLK |= EXCO_EXCO_PGM_CLK_CLK_ECO_Msk;
        EXCO_EXCO_PGM_CLK &= ~EXCO_EXCO_PGM_CLK_CLK_ECO_Msk;
    }

    EXCO_EXCO_PGM_CLK &= ~EXCO_EXCO_PGM_CLK_ENABLE_Msk;
}

/**
* \addtogroup group_sysclk_pll_funcs
* \{
*/

