Infineon/psoc4pdl/drivers/source/cy_sysclk.c
/*******************************************************************************
* Function Name: Cy_SysClk_PllSetSource
****************************************************************************//**
*
* Selects the PLL reference clock of the selected ClkHf.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \param source \ref cy_en_sysclk_pll_src_t
*
* \return  Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - the PLL reference clock source is selected \n
* CY_SYSCLK_INVALID_STATE - the PLL reference clock source is not enabled \n
* CY_SYSCLK_BAD_PARAM - some input parameter is invalid
*
* \note Call \ref SystemCoreClockUpdate after this function calling if
* ClkSys frequency is affected.
*
* \note Call \ref Cy_SysLib_SetWaitStates before this function calling if
* ClkSys frequency is increasing.
*
* \note Call \ref Cy_SysLib_SetWaitStates after this function calling if
* ClkSys frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllConfigure
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PllSetSource(uint32_t pllNum, cy_en_sysclk_pll_src_t source)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    if ((0UL == pllNum) && CY_SYSCLK_PLL_IS_SRC_VALID(source))
    {
        if (source != Cy_SysClk_PllGetSource(pllNum))
        {
            bool ecoOk = (0UL != Cy_SysClk_EcoGetFrequency());

            if (((CY_SYSCLK_PLL_SRC_ECO == source) && ecoOk) || Cy_SysClk_ImoIsEnabled())
            {
                CY_REG32_CLR_SET(EXCO_CLK_SELECT, EXCO_CLK_SELECT_REF_SEL, source);

                if (!ecoOk)
                {
                    EcoSeqGen();
                }
            }
            else
            {
                retVal = CY_SYSCLK_INVALID_STATE;
            }
        }
    }
    else
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }

    return (retVal);
}
/** \} group_sysclk_pll_funcs */
#endif /* EXCO_PLL_REF_IN_EN */


/* PLL REFERENCE_DIV bitfield allowable range */
#define PLL_MIN_REF_DIV      (0x00UL)
#define PLL_MAX_REF_DIV      (0x3FUL)

/* PLL FEEDBACK_DIV bitfield allowable range selection */
#define PLL_MIN_FB_DIV   (8UL)
#define PLL_MAX_FB_DIV   (255UL)

/* PLL OUTPUT_DIV bitfield allowable range */
#define PLL_MIN_OUT_DIV  (0UL)
#define PLL_MAX_OUT_DIV  (3UL)

/* Internal PLL frequencies ranges */
#define PLL_MIN_FVCO     (22500000UL)
#define PLL_MAX_FVCO     (104000000UL)
#define PLL_MIN_FPFD     (1000000UL)
#define PLL_MAX_FPFD     (3000000UL)

/* PLL input and output frequency limits */
#define PLL_MIN_IN_FREQ  (1000000UL)
#define PLL_MAX_IN_FREQ  (64000000UL)
#define PLL_MIN_OUT_FREQ (PLL_MIN_FVCO / (1UL << PLL_MIN_OUT_DIV))
#define PLL_MAX_OUT_FREQ ((PLL_MAX_FVCO > CY_SYSCLK_HF_CLK_MAX_FREQ) ? CY_SYSCLK_HF_CLK_MAX_FREQ : PLL_MAX_FVCO)

#define PLL_ICP_SEL_DEFAULT (2U) /* Currently Fout is always < 67 MHz */

/**
* \addtogroup group_sysclk_pll_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_PllConfigure
****************************************************************************//**
*
* Configures a given PLL.
* The configuration formula used is:
*   Fout = pll_clk * (P / Q / div_out), where:
*     Fout is the desired output frequency
*     pll_clk is the frequency of the input source
*     P is the feedback divider. Its value is in bitfield FEEDBACK_DIV.
*     Q is the reference divider. Its value is in bitfield REFERENCE_DIV.
*     div_out is the reference divider. Its value is in bitfield OUTPUT_DIV.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \param config The pointer to a configuration structure \ref cy_stc_sysclk_pll_config_t
*
* \return  Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters.
*
* \note
* In case of returning CY_SYSCLK_BAD_PARAM the function does not write anything into
* the configuration register, so either the previous correct configuration or
* the default configuration remains in the register.
*
* \note
* Call this function after changing the PLL input frequency, for example if
* \ref Cy_SysClk_ImoSetFrequency() or \ref Cy_SysClk_PllSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllConfigure
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PllConfigure(uint32_t pllNum, const cy_stc_sysclk_pll_config_t *config)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint32_t inputFreq = config->inputFreq;

    if (0UL == inputFreq)
    {
        if (CY_SYSCLK_PLL_SRC_ECO == Cy_SysClk_PllGetSource(pllNum))
        {
            inputFreq = Cy_SysClk_EcoGetFrequency();
        }
        else /* IMO */
        {
            inputFreq = Cy_SysClk_ImoGetFrequency();
        }

        if (0UL == inputFreq)
        {
            retVal = CY_SYSCLK_INVALID_STATE;
        }
    }

    if ((PLL_MIN_IN_FREQ <= inputFreq)  && (inputFreq <= PLL_MAX_IN_FREQ) &&
        (PLL_MIN_OUT_FREQ <= config->outputFreq) && (config->outputFreq <= PLL_MAX_OUT_FREQ))
    {
        cy_stc_sysclk_pll_manual_config_t manualConfig = {0U, 0U, 0U, PLL_ICP_SEL_DEFAULT};

        /* for each possible value of OUTPUT_DIV and REFERENCE_DIV (Q), try
           to find a value for FEEDBACK_DIV (P) that gives an output frequency
           as close as possible to the desired output frequency. */
        uint32_t q, fpfd;
        uint32_t foutBest = 0UL; /* to ensure at least one pass through the for loops below */

        /* REFERENCE_DIV (Q) selection */
        for (q = PLL_MIN_REF_DIV; (q <= PLL_MAX_REF_DIV) && (foutBest != (config->outputFreq)); q++)
        {
            fpfd = CY_SYSLIB_DIV_ROUND(inputFreq, 1UL + q);

            if ((PLL_MIN_FPFD <= fpfd) && (fpfd <= PLL_MAX_FPFD))
            {
                uint32_t p, fvco;

                /* FEEDBACK_DIV (P) selection */
                for (p = PLL_MIN_FB_DIV; (p <= PLL_MAX_FB_DIV) && (foutBest != (config->outputFreq)); p++)
                {
                    /* Calculate the intermediate Fvco, and make sure that it's in range */
                    fvco = fpfd * p;

