Infineon/psoc4pdl/drivers/source/cy_sysclk.c
                    if ((PLL_MIN_FVCO <= fvco) && (fvco <= PLL_MAX_FVCO))
                    {
                        uint32_t out;

                        /* OUTPUT_DIV selection */
                        for (out = PLL_MIN_OUT_DIV; (out <= PLL_MAX_OUT_DIV) && (foutBest != (config->outputFreq)); out++)
                        {
                            /* Calculate what output frequency will actually be produced.
                               If it's closer to the target than what we have so far, then save it. */
                            uint32_t fout = CY_SYSLIB_DIV_ROUND(fvco, 1UL << out);

                            if ((uint32_t)abs((int32_t)fout - (int32_t)(config->outputFreq)) <
                                (uint32_t)abs((int32_t)foutBest - (int32_t)(config->outputFreq)))
                            {
                                foutBest = fout;
                                manualConfig.feedbackDiv  = (uint8_t)p;
                                manualConfig.referenceDiv = (uint8_t)q;
                                manualConfig.outputDiv    = (uint8_t)out;
                            }
                        }
                    }
                }
            }
        } /* exit loops if foutBest equals outputFreq */

        /* configure PLL based on calculated values */
        retVal = Cy_SysClk_PllManualConfigure(pllNum, &manualConfig);
    } /* if no error */

    return (retVal);
}

/** \cond INTERNAL */
#define EXCO_PLL_CFG_Pos (EXCO_PLL_CONFIG_FEEDBACK_DIV_Pos)
#define EXCO_PLL_CFG_Msk (EXCO_PLL_CONFIG_FEEDBACK_DIV_Msk  | \
                          EXCO_PLL_CONFIG_REFERENCE_DIV_Msk | \
                          EXCO_PLL_CONFIG_OUTPUT_DIV_Msk    | \
                          EXCO_PLL_CONFIG_ICP_SEL_Msk)

#define CY_SYSCLK_IS_ICP_VALID(icp)  ((CY_SYSCLK_IS_PLL_ICP_LT67MHZ == (icp)) || \
                                      (CY_SYSCLK_IS_PLL_ICP_GT67MHZ == (icp)))
/** \endcond */

/*******************************************************************************
* Function Name: Cy_SysClk_PllManualConfigure
****************************************************************************//**
*
* Manually configures a PLL based on user inputs.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \param config \ref cy_stc_sysclk_pll_manual_config_t
*
* \return  Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters.
*
* \note
* In case of returning CY_SYSCLK_BAD_PARAM the function does not write anything into
* the configuration register, so either the previous correct configuration or
* the default configuration remains in the register.
*
* \note
* Call this function after changing the PLL input frequency, for example if
* \ref Cy_SysClk_ImoSetFrequency() or \ref Cy_SysClk_PllSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllManualConfigure
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PllManualConfigure(uint32_t pllNum, const cy_stc_sysclk_pll_manual_config_t *config)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    /* check for errors */
    if ((0UL == pllNum) &&
        (CY_SYSCLK_IS_ICP_VALID(config->icp)) &&
        (PLL_MAX_OUT_DIV >= (uint32_t)config->outputDiv) &&
        (PLL_MAX_REF_DIV >= (uint32_t)config->referenceDiv) &&
        (PLL_MIN_FB_DIV  <= (uint32_t)config->feedbackDiv))
    {
        if (Cy_SysClk_PllIsEnabled(pllNum))
        {
            retVal = CY_SYSCLK_INVALID_STATE;
        }
        else /* no errors */
        {
            uint32_t locPllCfg = _VAL2FLD(EXCO_PLL_CONFIG_FEEDBACK_DIV,  config->feedbackDiv)  |
                                 _VAL2FLD(EXCO_PLL_CONFIG_REFERENCE_DIV, config->referenceDiv) |
                                 _VAL2FLD(EXCO_PLL_CONFIG_OUTPUT_DIV,    config->outputDiv)    |
                                 _VAL2FLD(EXCO_PLL_CONFIG_ICP_SEL,       config->icp);

            CY_REG32_CLR_SET(EXCO_PLL_CONFIG, EXCO_PLL_CFG, locPllCfg); /* To preserve BYPASS_SEL bits */

            retVal = CY_SYSCLK_SUCCESS;
        }
    }

    return (retVal);
}

/*******************************************************************************
* Function Name: Cy_SysClk_PllGetConfiguration
****************************************************************************//**
*
* Reports configuration settings for a PLL.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \param config \ref cy_stc_sysclk_pll_manual_config_t
*
* \return  Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - PLL data successfully reported \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllManualConfigure
*
*******************************************************************************/
void Cy_SysClk_PllGetConfiguration(uint32_t pllNum, cy_stc_sysclk_pll_manual_config_t * config)
{
    CY_ASSERT_L1(0UL == pllNum);
    CY_ASSERT_L1(NULL != config);

    if ((0UL == pllNum) && (NULL != config))
    {
        uint32_t locReg = EXCO_PLL_CONFIG;
        config->feedbackDiv  = (uint8_t)_FLD2VAL(EXCO_PLL_CONFIG_FEEDBACK_DIV,  locReg);
        config->referenceDiv = (uint8_t)_FLD2VAL(EXCO_PLL_CONFIG_REFERENCE_DIV, locReg);
        config->outputDiv    = (uint8_t)_FLD2VAL(EXCO_PLL_CONFIG_OUTPUT_DIV,    locReg);
        config->icp          = (uint8_t)_FLD2VAL(EXCO_PLL_CONFIG_ICP_SEL,       locReg);
    }
}

