Infineon/psoc4pdl/drivers/source/cy_sysclk.c
                                CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                            }

                            /* Change this path source to IMO */
                            (void)Cy_SysClk_ClkPathSetSource(fllpll, CY_SYSCLK_CLKPATH_IN_IMO);

                            /* Store a record that this path source was changed from ECO */
                            changedSourcePaths |= (uint16_t)(1UL << fllpll);
                        }
                        else if (0UL == fllpll)
                        {
                            CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
                        }
                        else
                        {
                            /* Do nothing */
                        }
                    }
                }

                retVal = CY_SYSPM_SUCCESS;
            }
            break;

        case CY_SYSPM_AFTER_TRANSITION:
            {
                /* After return from Deep Sleep, for each FLL/PLL, if needed, restore the source to ECO.
                 * And block until the FLL/PLL has regained its frequency lock.
                 */
                uint32_t timeout = TIMEOUT;
                retVal = CY_SYSPM_TIMEOUT;

                if (0U != changedSourcePaths)
                {
                    /* If any FLL/PLL was sourced by the ECO, timeout wait for the ECO to become fully stabilized again */
                    while ((CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (0UL != timeout))
                    {
                        timeout--;
                    }

                    if (0UL != timeout)
                    {
                        uint32_t fllpll; /* 0 = FLL, all other values = PLL */

                        for (fllpll = 0UL; fllpll <= CY_SRSS_NUM_PLL; fllpll++)
                        {
                            /* If there is a correspondent record about a changed clock source */
                            if (0U != (changedSourcePaths & (uint16_t)(1UL << fllpll)))
                            {
                                /* Change this path source back to ECO */
                                (void)Cy_SysClk_ClkPathSetSource(fllpll, CY_SYSCLK_CLKPATH_IN_ECO);

                                /* Timeout wait for FLL/PLL to regain lock.
                                 * Split FLL and PLL lock polling loops into two separate threads to minimize one polling loop duration.
                                 */
                                if (0UL == fllpll)
                                {
                                    while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
                                    {
                                        timeout--;
                                    }
                                }
                                else
                                {
                                    while ((!Cy_SysClk_PllLocked(fllpll)) && (0UL != timeout))
                                    {
                                        timeout--;
                                    }
                                }

                                if (0UL != timeout)
                                {
                                    /* Undo bypass the FLL/PLL */
                                    if (0UL == fllpll)
                                    {
                                        CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                                    }
                                    else
                                    {
                                        if (0U != (pllAutoModes & (uint16_t)(1UL << fllpll)))
                                        {
                                            CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_AUTO);
                                        }
                                        else
                                        {
                                            CY_REG32_CLR_SET(SRSS_CLK_PLL_CONFIG[fllpll - 1UL], SRSS_CLK_PLL_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                                        }
                                    }

                                    retVal = CY_SYSPM_SUCCESS;
                                }
                            }
                        }
                    }
                }
                else if (Cy_SysClk_FllIsEnabled())
                {
                    /* Timeout wait for FLL to regain lock */
                    while ((!Cy_SysClk_FllLocked()) && (0UL != timeout))
                    {
                        timeout--;
                    }

                    if (0UL != timeout)
                    {
                        /* Undo bypass the FLL */
                        CY_REG32_CLR_SET(SRSS_CLK_FLL_CONFIG3, SRSS_CLK_FLL_CONFIG3_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT);
                        retVal = CY_SYSPM_SUCCESS;
                    }
                }
                else
                {
                    retVal = CY_SYSPM_SUCCESS;
                }

                preventCounting = false; /* Allow clock measurement */
            }
            break;

        default: /* Unsupported mode, return CY_SYSPM_FAIL */
            break;
    }

    return (retVal);
}
/** \} group_sysclk_pm_funcs */
#endif


/* ========================================================================== */
/* =========================    ClkHf SECTION    ========================= */
/* ========================================================================== */

/** \cond */
#define  PLL_FLAG (0x4UL)

#if defined (CY_IP_M0S8EXCO)
#if defined(EXCO_PLL_PRESENT)
    #define  CY_SYSCLK_IS_SOURCE_VALID(src) (((src) == CY_SYSCLK_CLKHF_IN_IMO)  || \
                                             ((src) == CY_SYSCLK_CLKHF_IN_EXT)  || \
                                             ((src) == CY_SYSCLK_CLKHF_IN_ECO)  || \
                                             ((src) == CY_SYSCLK_CLKHF_IN_PLL))
#else /* EXCO_PLL_PRESENT */
    #define  CY_SYSCLK_IS_SOURCE_VALID(src) (((src) == CY_SYSCLK_CLKHF_IN_IMO)  || \
                                             ((src) == CY_SYSCLK_CLKHF_IN_EXT)  || \
                                             ((src) == CY_SYSCLK_CLKHF_IN_ECO))
#endif /* EXCO_PLL_PRESENT */
#else /* CY_IP_M0S8EXCO */
    #define  CY_SYSCLK_IS_SOURCE_VALID(src) (((src) == CY_SYSCLK_CLKHF_IN_IMO)  || \
                                             ((src) == CY_SYSCLK_CLKHF_IN_EXT))
#endif /* CY_IP_M0S8EXCO */
/** \endcond */

/**
* \addtogroup group_sysclk_clk_hf_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfSetSource
****************************************************************************//**
*
* Selects the source of the selected ClkHf.
*
* \param source \ref cy_en_sysclk_clkhf_src_t
*
* \return  Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - the source is successfully set \n
* CY_SYSCLK_INVALID_STATE - the selected clock source is not enabled \n
* CY_SYSCLK_BAD_PARAM - the source parameter is invalid.
*
* \note Call \ref SystemCoreClockUpdate after this function calling if
* ClkSys frequency is affected.
*
* \note Call \ref Cy_SysLib_SetWaitStates before this function calling if
* ClkSys frequency is increasing.
*
* \note Call \ref Cy_SysLib_SetWaitStates after this function calling if
* ClkSys frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoDisable
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkHfSetSource(cy_en_sysclk_clkhf_src_t source)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    if (CY_SYSCLK_IS_SOURCE_VALID(source))
    {
        cy_en_sysclk_clkhf_src_t prevSrc = Cy_SysClk_ClkHfGetSource();

        if (source != prevSrc)
        {
            if (((CY_SYSCLK_CLKHF_IN_IMO == source) && (!Cy_SysClk_ImoIsEnabled()))
            #if defined (CY_IP_M0S8EXCO)
                ||  ((CY_SYSCLK_CLKHF_IN_ECO == source) && (0UL == Cy_SysClk_EcoGetFrequency()))
            #if defined(EXCO_PLL_PRESENT)
                ||  ((CY_SYSCLK_CLKHF_IN_PLL == source) && (!Cy_SysClk_PllIsEnabled(0UL)))
            #endif /* EXCO_PLL_PRESENT */
            #endif /* CY_IP_M0S8EXCO */
                )
            {
                retVal = CY_SYSCLK_INVALID_STATE;
            }
            else
            {
            #if defined(EXCO_PLL_PRESENT)
                if ((CY_SYSCLK_CLKHF_IN_PLL == source) || (CY_SYSCLK_CLKHF_IN_PLL == prevSrc))
                {
                    CY_REG32_CLR_SET(EXCO_CLK_SELECT, EXCO_CLK_SELECT_CLK_SELECT, (0UL != (PLL_FLAG & (uint32_t) source)) ? 1UL : 0UL);
                    if (0UL == Cy_SysClk_EcoGetFrequency())
                    {
                        EcoSeqGen();
                    }
                }
            #endif /* EXCO_PLL_PRESENT */

