Infineon/psoc4pdl/drivers/source/cy_sysclk.c
                CY_REG32_CLR_SET(SRSSLT_CLK_SELECT, SRSSLT_CLK_SELECT_HFCLK_SEL, source);
            }
        }
    }
    else
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfGetSource
****************************************************************************//**
*
* Reports the source of the ClkHf.
*
* \return \ref cy_en_sysclk_clkhf_src_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoDisable
*
*******************************************************************************/
cy_en_sysclk_clkhf_src_t Cy_SysClk_ClkHfGetSource(void)
{
    uint32_t retVal = _FLD2VAL(SRSSLT_CLK_SELECT_HFCLK_SEL, SRSSLT_CLK_SELECT);

#if defined(EXCO_PLL_PRESENT)
    if (CY_SYSCLK_CLKHF_IN_ECO == retVal)
    {
        retVal |= ((0UL != (EXCO_CLK_SELECT & EXCO_CLK_SELECT_CLK_SELECT_Msk)) ? PLL_FLAG : 0UL);
    }
#endif /* EXCO_PLL_PRESENT */

    return ((cy_en_sysclk_clkhf_src_t)retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfGetFrequency
****************************************************************************//**
*
* Reports the frequency of the ClkHf
*
* \return The frequency, in Hz.
*
* \note
* The reported frequency may be zero, which indicates unknown.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfSetDivider
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkHfGetFrequency(void)
{
    uint32_t freq = 0UL;    /* ClkHf source clock frequency, in Hz, 0 = unknown frequency */
    /* Convert the cy_en_clkhf_dividers_t value into the natural number of divider */
    uint32_t div = (uint32_t) (1UL << (uint32_t)Cy_SysClk_ClkHfGetDivider());
    cy_en_sysclk_clkhf_src_t source = Cy_SysClk_ClkHfGetSource(); /* source input for ClkHf */

    /* get the frequency of the source, i.e., the path mux input */
    switch(source)
    {
        case CY_SYSCLK_CLKHF_IN_IMO:
            freq = Cy_SysClk_ImoGetFrequency();
            break;

        case CY_SYSCLK_CLKHF_IN_EXT:
            freq = Cy_SysClk_ExtClkGetFrequency();
            break;

    #if defined (CY_IP_M0S8EXCO)
        case CY_SYSCLK_CLKHF_IN_ECO:
            freq = Cy_SysClk_EcoGetFrequency();
            break;

    #if defined (EXCO_PLL_PRESENT)
        case CY_SYSCLK_CLKHF_IN_PLL:
            freq = Cy_SysClk_PllGetFrequency(0UL);
            break;

    #endif /* EXCO_PLL_PRESENT */
    #endif /* CY_IP_M0S8EXCO */
        default:
            /* Unsupported clock source, return 0 */
            break;
    }

    /* Divide the path input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(freq, div));
}

/** \} group_sysclk_clk_hf_funcs */


/* ========================================================================== */
/* =====================    clk_peripherals SECTION    ====================== */
/* ========================================================================== */

/** \cond */
#if (0U != PERI_PCLK_DIV_8_NR)
#define IS_DIV_8_TYPE_NUM_VALID(typ, num)    (((typ) == CY_SYSCLK_DIV_8_BIT)    && ((num) < PERI_PCLK_DIV_8_NR))
#else
#define IS_DIV_8_TYPE_NUM_VALID(typ, num)    (false)
#endif

#if (0U != PERI_PCLK_DIV_16_NR)
#define IS_DIV_16_TYPE_NUM_VALID(typ, num)   (((typ) == CY_SYSCLK_DIV_16_BIT)   && ((num) < PERI_PCLK_DIV_16_NR))
#else
#define IS_DIV_16_TYPE_NUM_VALID(typ, num)   (false)
#endif

#if (0U != PERI_PCLK_DIV_16_5_NR)
#define IS_DIV_16_5_TYPE_NUM_VALID(typ, num) (((typ) == CY_SYSCLK_DIV_16_5_BIT) && ((num) < PERI_PCLK_DIV_16_5_NR))
#else
#define IS_DIV_16_5_TYPE_NUM_VALID(typ, num) (false)
#endif

#if (0U != PERI_PCLK_DIV_24_5_NR)
#define IS_DIV_24_5_TYPE_NUM_VALID(typ, num) (((typ) == CY_SYSCLK_DIV_24_5_BIT) && ((num) < PERI_PCLK_DIV_24_5_NR))
#else
#define IS_DIV_24_5_TYPE_NUM_VALID(typ, num) (false)
#endif

#define IS_DIV_INT_TYPE_NUM_VALID(typ, num)  (IS_DIV_8_TYPE_NUM_VALID((typ), (num)) || \
                                              IS_DIV_16_TYPE_NUM_VALID((typ), (num)))

#define IS_DIV_FRC_TYPE_NUM_VALID(typ, num)  (IS_DIV_16_5_TYPE_NUM_VALID((typ), (num)) || \
                                              IS_DIV_24_5_TYPE_NUM_VALID((typ), (num)))

#define IS_DIV_TYPE_NUM_VALID(typ, num)      (IS_DIV_INT_TYPE_NUM_VALID((typ), (num)) || \
                                              IS_DIV_FRC_TYPE_NUM_VALID((typ), (num)))

#define IS_DIV_PA_TYPE_NUM_VALID(typ, num)   (IS_DIV_TYPE_NUM_VALID((typ), (num)) || \
                                              (((typ) == CY_SYSCLK_DIV_24_5_BIT) && ((num) == 63UL)))
/** \endcond */

/**
* \addtogroup group_sysclk_clk_peripheral_funcs
* \{
*/


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphSetDivider
****************************************************************************//**
*
* Sets one of the programmable clock dividers. This is only used for integer
* dividers. Use \ref Cy_SysClk_PeriphSetFracDivider for setting factional dividers.
*
* \pre If the specified clock divider is already enabled - it should be disabled
* prior to use this function by \ref Cy_SysClk_PeriphDisableDivider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum the divider number.
*
* \param dividerValue divider value
* Causes integer division of (divider value + 1), or division by 1 to 256
* (8-bit divider) or 1 to 65536 (16-bit divider).
*
* \return \ref cy_en_sysclk_status_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphSetDivider
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriphSetDivider(cy_en_sysclk_divider_types_t dividerType,
                                                                     uint32_t dividerNum,
                                                                     uint32_t dividerValue)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
#if (0UL != PERI_PCLK_DIV_8_NR)
    if (IS_DIV_8_TYPE_NUM_VALID(dividerType, dividerNum) &&
        (dividerValue <= (PERI_DIV_8_CTL_INT8_DIV_Msk >> PERI_DIV_8_CTL_INT8_DIV_Pos)))
    {
        CY_REG32_CLR_SET(PERI_DIV_8_CTL[dividerNum], PERI_DIV_8_CTL_INT8_DIV, dividerValue);
        retVal = CY_SYSCLK_SUCCESS;
    }
    else
#endif /* PERI_PCLK_DIV_8_NR */
#if (0UL != PERI_PCLK_DIV_16_NR)
    if (IS_DIV_16_TYPE_NUM_VALID(dividerType, dividerNum) &&
        (dividerValue <= (PERI_DIV_16_CTL_INT16_DIV_Msk >> PERI_DIV_16_CTL_INT16_DIV_Pos)))
    {
        CY_REG32_CLR_SET(PERI_DIV_16_CTL[dividerNum], PERI_DIV_16_CTL_INT16_DIV, dividerValue);
        retVal = CY_SYSCLK_SUCCESS;
    }
    else
#endif /* PERI_PCLK_DIV_16_NR */
    {
        /* return bad parameter */
    }
    return (retVal);
}

