Infineon/psoc4pdl/drivers/source/cy_sysclk.c
/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetDivider
****************************************************************************//**
*
* Returns the integer divider value for the specified divider. One works for
* integer dividers. Use \ref Cy_SysClk_PeriphGetFracDivider to get the fractional
* divider value
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \return The divider value.
* The integer division done is by (divider value + 1), or division by 1 to 256
* (8-bit divider) or 1 to 65536 (16-bit divider).
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphSetDivider
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriphGetDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum)
{
    uint32_t retVal = 0UL;

    CY_ASSERT_L1(IS_DIV_INT_TYPE_NUM_VALID(dividerType, dividerNum));

#if (0UL != PERI_PCLK_DIV_8_NR)
    if (IS_DIV_8_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        retVal = _FLD2VAL(PERI_DIV_8_CTL_INT8_DIV, PERI_DIV_8_CTL[dividerNum]);
    }
    else
#endif /* PERI_PCLK_DIV_8_NR */
#if (0UL != PERI_PCLK_DIV_16_NR)
    if (IS_DIV_16_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        retVal = _FLD2VAL(PERI_DIV_16_CTL_INT16_DIV, PERI_DIV_16_CTL[dividerNum]);
    }
    else
#endif /* PERI_PCLK_DIV_16_NR */
    {
        /* return zero divider */
    }
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphSetFracDivider
****************************************************************************//**
*
* Sets one of the programmable clock dividers. This function should only be used
* for fractional clock dividers.
*
* \pre If the specified clock divider is already enabled - it should be disabled
* prior to use this function by \ref Cy_SysClk_PeriphDisableDivider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \param dividerIntValue the integer divider value
* The source of the divider is peri_clk, which is a divided version of hf_clk[0].
* The divider value causes integer division of (divider value + 1), or division
* by 1 to 65536 (16-bit divider) or 1 to 16777216 (24-bit divider).
*
* \param dividerFracValue the fraction part of the divider
* The fractional divider can be 1-32, thus it divides the clock by 1/32 for each
* count. To divide the clock by 11/32nds set this value to 11.
*
* \return \ref cy_en_sysclk_status_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphSetFracDivider
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriphSetFracDivider(cy_en_sysclk_divider_types_t dividerType,
                                                                         uint32_t dividerNum,
                                                                         uint32_t dividerIntValue,
                                                                         uint32_t dividerFracValue)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

#if (0UL != PERI_PCLK_DIV_16_5_NR)
    if (IS_DIV_16_5_TYPE_NUM_VALID(dividerType, dividerNum) &&
        (dividerIntValue <= (PERI_DIV_16_5_CTL_INT16_DIV_Msk >> PERI_DIV_16_5_CTL_INT16_DIV_Pos)) &&
        (dividerFracValue <= (PERI_DIV_16_5_CTL_FRAC5_DIV_Msk >> PERI_DIV_16_5_CTL_FRAC5_DIV_Pos)))
    {
        CY_REG32_CLR_SET(PERI_DIV_16_5_CTL[dividerNum], PERI_DIV_16_5_CTL_INT16_DIV, dividerIntValue);
        CY_REG32_CLR_SET(PERI_DIV_16_5_CTL[dividerNum], PERI_DIV_16_5_CTL_FRAC5_DIV, dividerFracValue);
        retVal = CY_SYSCLK_SUCCESS;
    }
    else
#endif /* PERI_PCLK_DIV_16_5_NR */
#if (0UL != PERI_PCLK_DIV_24_5_NR)
    if (IS_DIV_24_5_TYPE_NUM_VALID(dividerType, dividerNum) &&
        (dividerIntValue <= (PERI_DIV_24_5_CTL_INT24_DIV_Msk >> PERI_DIV_24_5_CTL_INT24_DIV_Pos)) &&
        (dividerFracValue <= (PERI_DIV_24_5_CTL_FRAC5_DIV_Msk >> PERI_DIV_24_5_CTL_FRAC5_DIV_Pos)))
    {
        CY_REG32_CLR_SET(PERI_DIV_24_5_CTL[dividerNum], PERI_DIV_24_5_CTL_INT24_DIV, dividerIntValue);
        CY_REG32_CLR_SET(PERI_DIV_24_5_CTL[dividerNum], PERI_DIV_24_5_CTL_FRAC5_DIV, dividerFracValue);
        retVal = CY_SYSCLK_SUCCESS;
    }
    else
#endif /* PERI_PCLK_DIV_24_5_NR */
    {
        /* return bad parameter */
    }
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetFracDivider
****************************************************************************//**
*
* Reports the integer and fractional parts of the divider
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \param *dividerIntValue pointer to return integer divider value
*
* \param *dividerFracValue pointer to return fractional divider value
*
* \return None. Loads pointed-to variables.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphSetFracDivider
*
*******************************************************************************/
void Cy_SysClk_PeriphGetFracDivider(cy_en_sysclk_divider_types_t   dividerType,
                                                        uint32_t   dividerNum,
                                                        uint32_t * dividerIntValue,
                                                        uint32_t * dividerFracValue)
{
    CY_ASSERT_L1(IS_DIV_FRC_TYPE_NUM_VALID(dividerType, dividerNum));
    CY_ASSERT_L1(NULL != dividerIntValue);
    CY_ASSERT_L1(NULL != dividerFracValue);

#if (0UL != PERI_PCLK_DIV_16_5_NR)
    if (IS_DIV_16_5_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        *dividerIntValue  = _FLD2VAL(PERI_DIV_16_5_CTL_INT16_DIV, PERI_DIV_16_5_CTL[dividerNum]);
        *dividerFracValue = _FLD2VAL(PERI_DIV_16_5_CTL_FRAC5_DIV, PERI_DIV_16_5_CTL[dividerNum]);
    }
    else
#endif /* PERI_PCLK_DIV_16_5_NR */
#if (0UL != PERI_PCLK_DIV_24_5_NR)
    if (IS_DIV_24_5_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        *dividerIntValue  = _FLD2VAL(PERI_DIV_24_5_CTL_INT24_DIV, PERI_DIV_24_5_CTL[dividerNum]);
        *dividerFracValue = _FLD2VAL(PERI_DIV_24_5_CTL_FRAC5_DIV, PERI_DIV_24_5_CTL[dividerNum]);
    }
    else
#endif /* PERI_PCLK_DIV_24_5_NR */
    {
        *dividerIntValue  = 0UL;
        *dividerFracValue = 0UL;
    }
}


