Infineon/psoc4pdl/drivers/source/cy_sysclk.c
/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetFrequency
****************************************************************************//**
*
* Reports the frequency of the output of a given peripheral divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \return The frequency, in Hz.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphGetFrequency
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum)
{
    uint32_t integer = 0UL;        /* Integer part of peripheral divider */
    uint32_t freq = Cy_SysClk_ClkHfGetFrequency(); /* Get ClkHf frequency */

    CY_ASSERT_L1(IS_DIV_TYPE_NUM_VALID(dividerType, dividerNum));

    /* get the divider value for clk_peri to the selected peripheral clock */
    switch(dividerType)
    {
    #if (0UL != PERI_PCLK_DIV_8_NR)
        case CY_SYSCLK_DIV_8_BIT:
    #endif /* PERI_PCLK_DIV_8_NR */
    #if (0UL != PERI_PCLK_DIV_16_NR)
        case CY_SYSCLK_DIV_16_BIT:
    #endif /* PERI_PCLK_DIV_16_NR */
    #if ((0UL != PERI_PCLK_DIV_8_NR) || (0UL != PERI_PCLK_DIV_16_NR))
            integer = 1UL + Cy_SysClk_PeriphGetDivider(dividerType, dividerNum);
            freq = CY_SYSLIB_DIV_ROUND(freq, integer);
            break;
    #endif /* PERI_PCLK_DIV_8_NR or PERI_PCLK_DIV_16_NR */
    #if (0UL != PERI_PCLK_DIV_16_5_NR)
        case CY_SYSCLK_DIV_16_5_BIT:
    #endif /* PERI_PCLK_DIV_16_5_NR */
    #if (0UL != PERI_PCLK_DIV_24_5_NR)
        case CY_SYSCLK_DIV_24_5_BIT:
    #endif /* PERI_PCLK_DIV_24_5_NR */
    #if ((0UL != PERI_PCLK_DIV_16_5_NR) || (0UL != PERI_PCLK_DIV_24_5_NR))
            {
                uint32_t locFrac;
                uint32_t locDiv;
                uint32_t locFreq = freq * 32UL;
                Cy_SysClk_PeriphGetFracDivider(dividerType, dividerNum, &integer, &locFrac);
                /* For fractional dividers, the divider is (int + 1) + frac/32 */
                locDiv = ((1UL + integer) * 32UL) + locFrac;
                freq = CY_SYSLIB_DIV_ROUND(locFreq, locDiv);
            }
            break;
    #endif /* CY_SYSCLK_DIV_16_5_BIT or CY_SYSCLK_DIV_24_5_BIT */

        default:
            /* Invalid divider type */
            break;
    }

    return (freq);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphAssignDivider
****************************************************************************//**
*
* Assigns a programmable divider to a selected IP block, such as a TCPWM or SCB.
*
* \param periphNum specifies the peripheral block \ref en_clk_dst_t.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \return \ref cy_en_sysclk_status_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphAssignDivider
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriphAssignDivider(en_clk_dst_t periphNum, cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    if ((PERI_PCLK_CLOCK_NR > (uint32_t)periphNum) && IS_DIV_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        PERI_PCLK_CTL[periphNum] = _VAL2FLD(PERI_PCLK_CTL_SEL_TYPE, dividerType) |
                                   _VAL2FLD(PERI_PCLK_CTL_SEL_DIV,  dividerNum);
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphEnableDivider
****************************************************************************//**
*
* Enables the selected divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t
*
* \param dividerNum specifies which divider of the selected type to configure
*
* \note This function also sets the phase alignment bits such that the enabled
* divider is aligned to clk_peri. See \ref Cy_SysClk_PeriphDisableDivider()
* for information on how to phase-align a divider after it is enabled.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphEnableDivider
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriphEnableDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    if (IS_DIV_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        /* specify the divider, make the reference = clk_peri, and enable the divider */
        PERI_DIV_CMD = PERI_DIV_CMD_ENABLE_Msk             |
                       PERI_DIV_CMD_PA_SEL_TYPE_Msk        |
                       PERI_DIV_CMD_PA_SEL_DIV_Msk         |
              _VAL2FLD(PERI_DIV_CMD_SEL_TYPE, dividerType) |
              _VAL2FLD(PERI_DIV_CMD_SEL_DIV,  dividerNum);
        (void)PERI_DIV_CMD; /* dummy read to handle buffered writes */
        retVal = CY_SYSCLK_SUCCESS;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphDisableDivider
****************************************************************************//**
*
* Disables a selected divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t.
*
* \param dividerNum specifies which divider of the selected type to configure.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphDisableDivider
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriphDisableDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    if (IS_DIV_TYPE_NUM_VALID(dividerType, dividerNum))
    {
        /* specify the divider and disable it */
        PERI_DIV_CMD = PERI_DIV_CMD_DISABLE_Msk            |
              _VAL2FLD(PERI_DIV_CMD_SEL_TYPE, dividerType) |
              _VAL2FLD(PERI_DIV_CMD_SEL_DIV,  dividerNum);
        retVal = CY_SYSCLK_SUCCESS;
    }

    return (retVal);
}


