Infineon/psoc4pdl/drivers/source/cy_sysclk.c
/*******************************************************************************
* Function Name: Cy_SysClk_PeriphDividerIsEnabled
****************************************************************************//**
*
* Reports the enabled/disabled state of the selected divider.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t.
*
* \param dividerNum specifies which divider of the selected type to configure.
*
* \return The enabled/disabled state; \n
* false = disabled \n
* true = enabled
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphGetDividerEnabled
*
*******************************************************************************/
bool Cy_SysClk_PeriphDividerIsEnabled(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum)
{
    bool retVal = false;

    CY_ASSERT_L1(IS_DIV_TYPE_NUM_VALID(dividerType, dividerNum));

    switch(dividerType)
    {
        #if (0UL != PERI_PCLK_DIV_8_NR)
            case CY_SYSCLK_DIV_8_BIT:
                retVal = _FLD2BOOL(PERI_DIV_8_CTL_EN, PERI_DIV_8_CTL[dividerNum]);
                break;
        #endif /* PERI_PCLK_DIV_8_NR */
        #if (0UL != PERI_PCLK_DIV_16_NR)
            case CY_SYSCLK_DIV_16_BIT:
                retVal = _FLD2BOOL(PERI_DIV_16_CTL_EN, PERI_DIV_16_CTL[dividerNum]);
                break;
        #endif /* PERI_PCLK_DIV_16_NR */
        #if (0UL != PERI_PCLK_DIV_16_5_NR)
            case CY_SYSCLK_DIV_16_5_BIT:
                retVal = _FLD2BOOL(PERI_DIV_16_5_CTL_EN, PERI_DIV_16_5_CTL[dividerNum]);
                break;
        #endif /* PERI_PCLK_DIV_16_5_NR */
        #if (0UL != PERI_PCLK_DIV_24_5_NR)
            case CY_SYSCLK_DIV_24_5_BIT:
                retVal = _FLD2BOOL(PERI_DIV_24_5_CTL_EN, PERI_DIV_24_5_CTL[dividerNum]);
                break;
        #endif /* PERI_PCLK_DIV_24_5_NR */
            default:
                /* Invalid divider type */
                break;
    }
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphEnablePhaseAlignDivider
****************************************************************************//**
*
* First disables a selected divider (\ref Cy_SysClk_PeriphDisableDivider),
* then aligns that divider to another programmable divider, and enables the
* selected divider. The divider to align to must already be enabled in order
* to align a divider to it.
*
* \param dividerType specifies which type of divider to use; \ref cy_en_sysclk_divider_types_t.
*
* \param dividerNum specifies which divider of the selected type to configure.
*
* \param dividerTypePA type of divider to phase-align to; \ref cy_en_sysclk_divider_types_t.
*
* \param dividerNumPA divider number of type specified to phase align to.
*
* \note
* To phase-align a divider to clk_peri, set dividerTypePA to 3 and dividerNumPA
* to 63.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphEnablePhaseAlignDivider
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriphEnablePhaseAlignDivider(cy_en_sysclk_divider_types_t dividerType,
                                                                                  uint32_t dividerNum,
                                                              cy_en_sysclk_divider_types_t dividerTypePA,
                                                                                  uint32_t dividerNumPA)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    if (IS_DIV_PA_TYPE_NUM_VALID(dividerTypePA, dividerNumPA))
    {
        /* First, disable the divider that is to be phase-aligned.
           The other two parameters are checked in that function;
           if they're not valid, the divider is not disabled. */
        retVal = Cy_SysClk_PeriphDisableDivider(dividerType, dividerNum);
        if (retVal == CY_SYSCLK_SUCCESS)
        {
            /* Then, specify the reference divider, and the divider, and enable the divider */
            PERI_DIV_CMD = PERI_DIV_CMD_ENABLE_Msk             |
                  _VAL2FLD(PERI_DIV_CMD_PA_SEL_TYPE, dividerTypePA) |
                  _VAL2FLD(PERI_DIV_CMD_PA_SEL_DIV,  dividerNumPA)  |
                  _VAL2FLD(PERI_DIV_CMD_SEL_TYPE, dividerType)      |
                  _VAL2FLD(PERI_DIV_CMD_SEL_DIV,  dividerNum);
        }
    }
    return (retVal);
}

/** \} group_sysclk_clk_peripheral_funcs */


/* ========================================================================== */
/* =========================    clk_pump SECTION    ========================= */
/* ========================================================================== */


/*******************************************************************************
* Function Name: Cy_SysClk_ClkPumpSetSource
****************************************************************************//**
*
* Sets the source for the pump clock (clk_pump). The pump clock can be used for
* the analog pumps in the CTBm block.
*
* \param source \ref cy_en_sysclk_clkpump_src_t
*
* \return  Error / status code \ref cy_en_sysclk_status_t : \n
* CY_SYSCLK_SUCCESS - the source is successfully set \n
* CY_SYSCLK_INVALID_STATE - the selected clock source is not enabled \n
* CY_SYSCLK_BAD_PARAM - the source parameter is invalid.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPumpSetSource
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkPumpSetSource(cy_en_sysclk_clkpump_src_t source)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    if (CY_SYSCLK_IS_PUMP_SRC_VALID(source))
    {
        if (source != Cy_SysClk_ClkPumpGetSource())
        {
            if ((CY_SYSCLK_PUMP_IN_IMO == source) && (!Cy_SysClk_ImoIsEnabled()))
            {
                retVal = CY_SYSCLK_INVALID_STATE;
            }
            else
            {
                CY_REG32_CLR_SET(SRSSLT_CLK_SELECT, SRSSLT_CLK_SELECT_PUMP_SEL, source);
            }
        }
    }
    else
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }

    return (retVal);
}


/* [] END OF FILE */
